_org/2023-07-17-help-is-underway.org
#+title: Help is underway
#+filetags: :emacs:helpful:support:

* Help(ful)!
Today I stumbled on a small package called [[https://github.com/Wilfred/helpful][helpful]]. This package will extend the ~emacs~ help system. It provides a better way of displaying the help and is installed really quick. Just add the following lines:

#+begin_src emacs-lisp
(use-package helpful
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-command]  . helpful-command)
  ([remap describe-key]      . helpful-key))
#+end_src


Where I:
- use =use-package= to install a package
- map the helpful command to the different ~describe~ functions

And that is it for today. Small but simple update on the ~emacs~ help system.
